
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_storage_blob.dets
  * module.sa_dets.azurerm_storage_container.container[&#34;darts-st-migration&#34;]
* Update
  * azurerm_windows_virtual_machine.modernisation_windows[&#34;stgdartsmidmock&#34;]
* Delete
  * module.sa_dets.azurerm_storage_container.container[&#34;darts-dets-migration&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.dets will be created
  + resource "azurerm_storage_blob" "dets" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "darts-dets-blob-st-stg"
      + parallelism            = 8
      + size                   = 0
      + storage_account_name   = "sastgdartsartefacts"
      + storage_container_name = "dets-st-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_windows_virtual_machine.modernisation_windows["stgdartsmidmock"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "modernisation_windows" {
        id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Compute/virtualMachines/stgdartsmidmock"
        name                                                   = "stgdartsmidmock"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (25 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sa_dets.azurerm_storage_container.container["darts-dets-migration"] will be destroyed
  # (because key ["darts-dets-migration"] is not in for_each map)
  - resource "azurerm_storage_container" "container" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "https://sastgdartsartefacts.blob.core.windows.net/darts-dets-migration" -> null
      - metadata                          = {} -> null
      - name                              = "darts-dets-migration" -> null
      - resource_manager_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsartefacts/blobServices/default/containers/darts-dets-migration" -> null
      - storage_account_name              = "sastgdartsartefacts" -> null
    }

  # module.sa_dets.azurerm_storage_container.container["darts-st-migration"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "darts-st-migration"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "sastgdartsartefacts"
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":304,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->